<?php
/**
 * Created by PhpStorm.
 * User: rocky
 * Date: 2022-02-26
 * Time: 00:44
 */
return [
    'required' => '{{name}}空欄にすることはできません',
    'email' => 'メールアドレスの形式が正しくありません',
    'idCard' => '身分証の形式が合っていません',
    'url' => '有効なURLアドレスではありません',
    'number' => '数字である必要があります',
    'integer' => '整数である必要があります',
    'float' => '必ず浮動小数点数である必要があります',
    'mobile' => 'フォーマットが違います',
    'leng' => '長さが要件に合致していません ',
    'alpha' => 'アルファベットのみです',
    'alphaNum' => '英数字のみ可能です',
    'alnum' => '英数字のみ可能です',
    'alphaDash' => 'アルファベット、数字、アンダースコア（_）、およびハイフン（-）のみ使用できます',
    'chs' => '漢字だけ',
    'chsAlpha' => '漢字とアルファベットのみ可能です',
    'chsAlphaNum' => '漢字、アルファベット、数字のみが使用可能です',
    'chsDash' => '漢字、アルファベット、数字、アンダーバー(_)、およびハイフン(-)のみが使用できます',
    'in' => '{{name}}値エラー',
    'equals' => '{{name}}パスワードと同じである必要があります',
    'image' => '必ず画像である必要があります',
    'length' => '{{name}} 長さは {{minValue}} から {{maxValue}} の間でなければなりません',
    'creditCard' => '有効なクレジットカード番号である必要があります',
    'digit' => '{{name}}数字0-9までしか含めることができません',
    'base64' => '{{name}}必ずBase64形式',
    'arrayVal' => '{{name}} は配列形式である必要があります',
    'is_channel' => '{{name}} は配列 bool 形式でなければなりません',
];